// Задача 51: Задайте двумерный массив. Найдите сумму элементов, находящихся на главной диагонали
// (с индексами (0,0); (1;1) и т.д.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// Сумма элементов главной диагонали: 1+9+2 = 12

int[,] GenerateMatrix(int rows, int columns, int lowerBound, int upperBound)
{
  int[,] result = new int[rows, columns];
  for (int i = 0; i < rows; i++)
    for (int j = 0; j < columns; j++)
    {
      result[i, j] = new Random().Next(lowerBound, upperBound);
    }
  return result;
}

int IndexSumm(int[,] matrix)
{

  int summ = 0;
  int rows = matrix.GetLength(0);
  int columns = matrix.GetLength(1);
  if (rows > columns) rows = columns;
  for (int i = 0; i < rows; i++)
  {
    summ += matrix[i, i];
  }
  return summ;
}

void ShowMatrix(int[,] matrix)
{
  int rows = matrix.GetLength(0);
  int columns = matrix.GetLength(1);
  for (int i = 0; i < rows; i++)
  {
    for (int j = 0; j < columns; j++)
    {
      Console.Write(matrix[i, j] + "\t");
    }
    Console.WriteLine();
  }
}

int GetNum(string text)
{
  Console.Write(text);
  int num = int.Parse(Console.ReadLine());
  return num;
}

// Получение размерности от пользователя: m,n
int m = GetNum("Введите кол-во строк: ");
int n = GetNum("Введите кол-во столбцов: ");

// Генерируем массив
int[,] matrix = GenerateMatrix(m, n, 1, 9);

// обробатываем массив
//ChangeMatrix(matrix);

// Выводим массив
ShowMatrix(matrix);
// Выводим результат сумму
int summ = IndexSumm(matrix);
Console.WriteLine($"Сумма элементов главной диагонали: {summ}");
